# Pandas

In [3]:
import numpy as np
import pandas as pd

In [4]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a': 10, 'b': 20, 'c': 30}

In [5]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
# Another way to input values into the series function
ser1 = pd.Series([1,2,3,4], ['USA', 'Germany', 'USSR', 'Japan'])

In [11]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

### When are you adding series together, integers are converted to floats in order to retain all the information

# Data Frames

In [12]:
from numpy.random import randn

In [13]:
np.random.seed(101)

In [14]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X','Y',"Z"])

In [15]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [16]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
type(df['W'])

pandas.core.series.Series

In [18]:
type(df)

pandas.core.frame.DataFrame

In [19]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [20]:
df['new'] = df['W'] + df['Z']

In [21]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118 -0.319318 -0.848077  0.605965  1.257083
C -2.018168  0.740122  0.528813 -0.589001 -2.607169
D  0.188695 -0.758872 -0.933237  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [22]:
# ROWS

In [23]:
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.210676
Name: A, dtype: float64

In [24]:
df.iloc[2] # index integer based location

W     -2.018168
X      0.740122
Y      0.528813
Z     -0.589001
new   -2.607169
Name: C, dtype: float64

In [25]:
df.loc['B', 'Y']

-0.8480769834036315

In [26]:
df.loc[['A', 'B'], ["W", "Y"]]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

# Data Frames Part 2

In [27]:
df > 0

       W      X      Y      Z    new
A   True   True   True   True   True
B   True  False  False   True   True
C  False   True   True  False  False
D   True  False  False   True   True
E   True   True   True   True   True

In [28]:
df[df > 0]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.210676
B  0.651118       NaN       NaN  0.605965  1.257083
C       NaN  0.740122  0.528813       NaN       NaN
D  0.188695       NaN       NaN  0.955057  1.143752
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [29]:
df[( df['W'] > 0) & (df['Y'] > 1) ]

          W         X         Y         Z       new
E  0.190794  1.978757  2.605967  0.683509  0.874303

In [30]:
df.reset_index()

  index         W         X         Y         Z       new
0     A  2.706850  0.628133  0.907969  0.503826  3.210676
1     B  0.651118 -0.319318 -0.848077  0.605965  1.257083
2     C -2.018168  0.740122  0.528813 -0.589001 -2.607169
3     D  0.188695 -0.758872 -0.933237  0.955057  1.143752
4     E  0.190794  1.978757  2.605967  0.683509  0.874303

In [31]:
newind = 'CA NY WY OR CO'.split()

In [32]:
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [33]:
df['States'] = newind

In [34]:
df

          W         X         Y         Z       new States
A  2.706850  0.628133  0.907969  0.503826  3.210676     CA
B  0.651118 -0.319318 -0.848077  0.605965  1.257083     NY
C -2.018168  0.740122  0.528813 -0.589001 -2.607169     WY
D  0.188695 -0.758872 -0.933237  0.955057  1.143752     OR
E  0.190794  1.978757  2.605967  0.683509  0.874303     CO

# Data Frames Part 3

In [36]:
# Index level
outside = ['G1', 'G1',' G1', 'G2', 'G2', 'G2']
inside = [1, 2, 3, 1, 2, 3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [37]:
df = pd.DataFrame(randn(6,2), hier_index, ["A", "B"])

In [38]:
df

              A         B
G1  1  0.302665  1.693723
    2 -1.706086 -1.159119
 G1 3 -0.134841  0.390528
G2  1  0.166905  0.184502
    2  0.807706  0.072960
    3  0.638787  0.329646

In [39]:
# To call information from a multi-level index
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119

In [40]:
df.loc["G1"].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [41]:
# To give the indexes names
df.index.names = ['Groups', 'Num']

In [42]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
 G1    3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

### Cross section feature

In [43]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119

In [44]:
df.xs(1, level='Num')

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

# Missing Data

In [45]:
d = {'A': [1,2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1,2,3]}

In [47]:
df = pd.DataFrame(d)

In [48]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
# You can drop null or missing calues with:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [50]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Fill NaN Values

In [51]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [52]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Groupby

In [53]:
# Groupby allows you to group together rows based off a column and perform an aggregate function on them

In [54]:
data = {
    'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales': [200, 120, 340, 124, 243, 350]
}

In [55]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [59]:
by_company = df.groupby('Company')

In [60]:
by_company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [61]:
by_company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [62]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

# Merging, Joining, and Concatenating

In [63]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [64]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [65]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [66]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [67]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

# Operations

In [68]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [70]:
df['col2'].unique()

array([444, 555, 666])

In [71]:
df['col2'].nunique()

3

In [73]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64